DataFrame 확인하기

패키지 참조

In [1]:
from pandas import read_excel, DataFrame

데이터 준비

In [2]:
df = read_excel(r"C:\Users\한지은\OneDrive\바탕 화면\데이터분석\C. 데이터_다루기\01. Pandas 자료형\grade.xlsx", index_col="이름")
df

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

데이터 확인

-1. 데이터구조확인

In [3]:
# 1. 데이터 구조확인
df.ndim

2

In [4]:
# 2. 데이터 행,열 확인
df.shape

(5, 6)

In [5]:
# 3. 각 변수의 데이터 타입 확인
df.dtypes

학년     int64
성별    object
국어     int64
영어     int64
수학     int64
과학     int64
dtype: object

-2. 데이터 내용 확인

In [6]:
# 1. 열 조회
df['국어']

이름
철수    98
영희    88
민철    92
수현    63
호영    75
Name: 국어, dtype: int64

In [7]:
# 2. 열에 대한 데이터 타입 확인
type(df['국어'])

pandas.core.series.Series

In [8]:
# 3. 행 조회
df.loc['철수']
    #dataframe은 열이 우선한다. -> 행으로 조회시, loc붙여야 한다.

학년     1
성별    남자
국어    98
영어    77
수학    88
과학    64
Name: 철수, dtype: object

In [9]:
# 4. 행에 대한 데이터 타입 확인
type(df.loc['철수'])

pandas.core.series.Series

In [10]:
# 값 확인하기 (열 --> 행 순서)
df['국어']['철수']

98

In [11]:
# 값 확인하기 (행 --> 열 순서)
df.loc['철수']['국어']

98

In [13]:
# 값 변경하기
df.loc['철수','국어'] = 100 
    # 값 변경은 행-->열 순으로 진행되어야 한다. 
df

    학년  성별   국어  영어  수학  과학
이름
철수   1  남자  100  77  88  64
영희   2  여자   88  90  62  72
민철   1  남자   92  70  83  79
수현   3  여자   63  60  31  70
호영   4  남자   75  50  90  88

In [14]:
# 상위 n건 확인
#파라미터가 없을 경우 5개가 기본값
df.head(2)

    학년  성별   국어  영어  수학  과학
이름
철수   1  남자  100  77  88  64
영희   2  여자   88  90  62  72

In [15]:
# 하위 n건 확인
# 파라미터가 없을 경우 5개가 기본값
df.tail(2)

    학년  성별  국어  영어  수학  과학
이름
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

In [16]:
# 특정 열에 대한 데이터 빈도수 확인
df['성별'].value_counts()

성별
남자    3
여자    2
Name: count, dtype: int64